% Задаю функцию f(x, y)
f = @(x, y) log(1 + x^2) + y;

% Устаналиваю значение y_0
y0 = 0.6;

% Решаю диференциальное уравнение при помощи встроенной функции
[X, Y] = ode45(f, [0 1], y0);

% Строю график по точкам
plot(X, Y);
title 'График численного решения y(x)';
xlabel 'x';
ylabel 'y';

% Вывожу результат в виде таблицы
fprintf('|—————————————————|\n|    x   |    y   |\n|--------|--------|\n');
i = 0;
for x = X
    i = i + 1;
    fprintf('|%f|%f|\n', x, y(i));
end
fprintf('|—————————————————|\n')